# Программа для формирования нового массива строк

Эта программа позволяет формировать новый массив строк из имеющегося массива, в котором строки имеют длину меньше или равную 3 символам.

## Описание задачи

Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:
- ["Hello", "2", "world", ":-)"] → ["2", ":-)"]
- ["1234", "1567", "-2", "computer science"] → ["-2"]
- ["Russia", "Denmark", "Kazan"] → []

## Описание программы

Программа состоит из нескольких функций:

### PrintArray
Функция `PrintArray` принимает на вход массив строк и выводит его содержимое в формате `[элемент1, элемент2, ...]`.

### CountStrings
Функция `CountStrings` принимает на вход массив строк и максимальную длину строки. Она подсчитывает количество строк в массиве, длина которых меньше или равна заданной длине.

### CreateArrayStr
Функция `CreateArrayStr` принимает на вход массив строк и максимальную длину строки. Она формирует новый массив строк, содержащий только строки из исходного массива, удовлетворяющие заданной длине.

### Пример использования
```csharp
string[] array = new string[] { "Hello", "2", "world", ":-)" };
int maxLength = 3;
string[] newArray = CreateArrayStr(array, maxLength);
PrintArray(array);
Console.WriteLine();
PrintArray(newArray);
